[
    {
        "info": "La bandera de Cuba es uno de los símbolos oficiales de este país. Fue creada en 1849 por Miguel Teurbe Tolón por petición del militar Narciso López en Nueva York, adoptada por la Asamblea Constituyente de Guáimaro, reunida en 1869. Fue oficialmente adoptada en 1902 como bandera de la Cuba independiente. Después de luchar bajo las órdenes de la Corona española contra el ejército libertador de Venezuela, en 1823 Narciso López se trasladó desde su natal Caracas hacia La Habana, Cuba. Allí su mentalidad cambió, lo cual lo llevó a rebelarse contra España, a la que había defendido años antes. Su apoyo a la causa revolucionaria lo condujo al exilio en los Estados Unidos, donde se involucró en organizaciones en pro de la libertad de Cuba. En 1849, Narciso López se encontraba con el exilio cubano en la ciudad de Nueva York llevando a cabo los planes de una posible insurrección en la isla con el apoyo de los Estados Unidos. Una mañana, cuenta la leyenda que una vez levantado López de su sueño y al mirar por la ventana, vio en el cielo los colores del alba de la mañana. A lo lejos pudo apreciar “un triángulo de nubes rojas que anunciaban el alba, y en el triángulo brillaba el lucero de Venus, la estrella de la mañana, mientras dos nubes blancas partían desde el triángulo para dividir en tres franjas azules el cielo resplandeciente”. Entusiasmado por lo que acababa de ver, López se dirigió a su amigo, Miguel Teurbe Tolón, para contárselo. Al margen de esta versión, lo evidenciado por la propia historia de Narciso López es que la bandera fue inspirada de manera general en la de los Estados Unidos (la expedición a Cuba de 1850 tenía como objetivo la anexión). Las tres franjas azules representan los tres departamentos en que estaba dividida Cuba en aquel momento; las blancas, la pureza de ideales, la luz; el triángulo rojo, motivo masón originario de la Revolución Francesa y de los tres ideales de libertad, igualdad y fraternidad; el color rojo, la sangre y la valentía; la estrella, extendido símbolo militar, era el nuevo Estado que debería sumarse a los Estados Unidos. Miguel Teurbe Tolón fue quien le diseñó la bandera a López con el relato de su visión, y Emilia Teurbe Tolón, esposa de Miguel, fue quien la cosió a mano por vez primera. Narciso López, el poeta Miguel Teurbe Tolón, José Aniceto Iznaga Borrell, su sobrino José María Sánchez Iznaga, Cirilo Villaverde y Juan Manuel Macias, confeccionaron la bandera de Cuba, que es hoy el pabellón oficial: dos franjas blancas, tres azules, un triángulo rojo y una estrella solitaria. Sobre ella juraron luchar y dar la vida por hacer a Cuba independiente. Un año después del comienzo de la Guerra de los Diez Años, se reunió la primera Asamblea Constituyente de la República de Cuba en Armas en Guáimaro, Provincia de Camagüey. El debate se enfocó entre dos banderas de gran simbolismo, la Demajagua creada por Carlos Manuel de Céspedes al dar comienzo a la guerra independentista, y la de la Estrella Solitaria de Narciso López, siendo ésta la elegida, ya que Narciso López había sido quien había dado el primer paso por la libertad de Cuba. La bandera de La Demajagua no fue desechada, sino al contrario, fue puesta en las sesiones de la Cámara de Representantes y conservada como parte del tesoro nacional."
    },
    {
        "info": "La bandera tiene un significado completamente alineado con la masonería, puesto que los dirigentes del Ejército libertador eran masones. No se tardó en aceptar el triángulo, símbolo de la Providencia. Para los masones, el triángulo rojo también simboliza la grandeza del poder que asiste al Gran Arquitecto del Universo y cuyos lados iguales aluden a la divisa masónica de libertad, igualdad, fraternidad y a la división tripartita del poder democrático. La estrella de cinco puntas significa la perfección del maestro masón: la fuerza, la belleza, la sabiduría, la virtud y la solidaridad. La bandera comprende además en su integración los tres números simbólicos. El tres (tres franjas azules) representa la armonía perfecta; el cinco, resultado de la suma de todas las franjas, significa el espíritu vivificador, que perpetúa la naturaleza; y el siete, que se obtiene al sumar el triángulo y la estrella, es un número considerado divino por los judíos, los griegos, y los masones.”3​ La estrella republicana blanca en el centro del triángulo rojo (representada en el centro como simbolismo de la inalteración de los derechos del hombre ,representado como el soberano; y al principio tenía una punta dirigida hacia el extremo derecho del triángulo) también representa la unión del pueblo cubano en un solo fulgor. Estrella solitaria: Estrella de cinco puntas representa el hombre con sus cinco sentidos, en la razón. Para los masones la perfección del maestro masón: la fuerza, la belleza, la sabiduría, la virtud, y la caridad. Se pone en el centro del triángulo para representar que el hombre es el soberano, con sus derechos intocables. Triángulo equilátero (tres lados iguales): El triángulo es equilátero para representar los tres poderes de la República: poder Ejecutivo, Legislativo y el Judicial. La República tiene que tener estos tres poderes balanceados en orden para que el soberano, la estrella, siga siendo el centro de la República. También se le atribuye la divisa masónica de Libertad, Igualdad y Fraternidad como características fundamentales de la República. El rojo no significa sangre, ya que la bandera se confecciona antes de las guerras independentistas, por ende no había sangre derramada. El rojo significa Providencia, representando que los derechos del individuo nacen con su humanidad, vienen del ser supremo. Una nación bajo Dios. Las tres listas azules: Representan las tres etapas del hombre para llegar a su grandeza, Aprendiz, Acompañante y Maestro. Lo cual hace alusión a la responsabilidad del hombre a aprender, a acompañar y a enseñar para mantener la República. El azul significa la fuerza y la belleza en su más alto significado Las dos listas blancas: Representan las dos columnas del templo de Salomón, la entrada a lo divino y pilares de la República. Blancas por la pureza de los ideales necesarios para la construcción de tal obra, la República. Las cinco franjas, poniendo la bandera en vertical, sostienen la República que defiende al individuo, lo que significa el Estado Soberano. Los números, que representan a cada elemento, también tienen un gran significado. El 2, las dos franjas blancas, significa la Unión y la Pureza; el 3, tres franjas azules, significa la armonía perfecta, El 5, suma de las franjas, significa el espíritu vivificador que perpetúa la naturaleza; y el 7, que se obtiene sumando el triángulo y la estrella con las franjas, es el número divino para los judíos, los griegos y masones."
    },
    {
        "info": ""
    }
]